fixtures/demo-configuration/src/Documents/ПриходТовара/ПриходТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходТовара</name>
  <basedOn>Catalog.Контрагенты</basedOn>
  <registerRecords>AccountingRegister.Основной</registerRecords>
  <registerRecords>AccumulationRegister.ТоварныеЗапасы</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fixtures/demo-configuration/src/AccumulationRegisters/ТоварныеЗапасы/ТоварныеЗапасы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварныеЗапасы</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fixtures/demo-configuration/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>Сумма</name>
    <comment>Задолженность нашей организации</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fixtures/demo-configuration/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fixtures/demo-configuration/src/AccountingRegisters/Основной/Основной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Основной</name>
  <chartOfAccounts>ChartOfAccounts.Основной</chartOfAccounts>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
</mdclass:AccountingRegister>

fixtures/demo-configuration/src/ChartsOfAccounts/Основной/Основной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Основной</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>1        </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Деньги</name>
      <description>Деньги</description>
      <code>2        </code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
  <attributes>
    <name>Реквизит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <accountingFlags>
    <name>ПризнакУчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>ПризнакУчетаСубконто</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

fixtures/demo-configuration/src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>CatalogRef.ВидыЦен</types>
    <types>CatalogRef.Валюты</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.РасчетныеСчета</types>
    <types>CatalogRef.РасчетныеСчетаКонтрагентов</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.Товары</types>
  </type>
  <predefined>
    <items>
      <name>Контрагент</name>
      <description>Контрагент</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Валюта</name>
      <description>Валюта</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </items>
    <items>
      <name>РасчетныйСчет</name>
      <description>Расчетный счет</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.РасчетныеСчета</types>
      </type>
    </items>
    <items>
      <name>Склад</name>
      <description>Склад</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>РасчетныйСчетКонтрагента</name>
      <description>Расчетный счет контрагент</description>
      <code>000000005</code>
      <type>
        <types>CatalogRef.РасчетныеСчетаКонтрагентов</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

fixtures/demo-configuration/src/Documents/ПриходТовара/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

Процедура ОбработкаПроведения(Отказ, Режим)

	// Создание движений в регистре накопления ТоварныеЗапасы
	Движения.ТоварныеЗапасы.Записывать = Истина;
	Для каждого ТекСтрокаТовары Из Товары Цикл

		Движение = Движения.ТоварныеЗапасы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТовары.Товар;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаТовары.Количество;

	КонецЦикла;

	// Создание движения в регистре накопления Взаиморасчеты
	Движения.Взаиморасчеты.Записывать = Истина;
	Движение = Движения.Взаиморасчеты.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Контрагент = Поставщик;
	Движение.Валюта = Валюта;

	Если Валюта.Пустая() Тогда

		Движение.Сумма = Товары.Итог("Сумма");

	Иначе

		Курс = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", Валюта)).Курс;

		Если Курс = 0 Тогда
			Движение.Сумма = Товары.Итог("Сумма");
		Иначе
			Движение.Сумма = Товары.Итог("Сумма") / Курс;
		КонецЕсли;

	КонецЕсли;
	
	СформироватьПроводкиБухгалтерия();

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда

		ЗапросПоКонтрагенту = Новый Запрос("ВЫБРАТЬ
		                                   |	Контрагенты.ЭтоГруппа
		                                   |ИЗ
		                                   |	Справочник.Контрагенты КАК Контрагенты
		                                   |ГДЕ
		                                   |	Контрагенты.Ссылка = &КонтрагентСсылка");
		ЗапросПоКонтрагенту.УстановитьПараметр("КонтрагентСсылка", ДанныеЗаполнения);
		Выборка = ЗапросПоКонтрагенту.Выполнить().Выбрать();
		Если Выборка.Следующий() И Выборка.ЭтоГруппа Тогда
			Возврат;
		КонецЕсли;
		
		Поставщик = ДанныеЗаполнения.Ссылка;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Удалим из списка проверяемых реквизитов валюту, если по организации не ведется 
	//валютный учет
	Если НЕ ПолучитьФункциональнуюОпцию("ВалютныйУчет", Новый Структура("Организация", Организация)) Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Валюта"));
	КонецЕсли;	
	
КонецПроцедуры

Процедура СформироватьПроводкиБухгалтерия()
	
	Курс = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", Валюта)).Курс;

	Если Курс = 0 Тогда
		Сумма = Товары.Итог("Сумма");
	Иначе
		Сумма = Товары.Итог("Сумма") / Курс;
	КонецЕсли;
	
	Движения.Основной.Записывать = Истина;
	Проводка = Движения.Основной.ДобавитьКредит();
	Проводка.Организация = Организация;
	Проводка.Период = Дата;
	Проводка.Сумма = Сумма;
	Проводка.Счет = ПланыСчетов.Основной.Деньги;
	Проводка.Субконто[ПланыВидовХарактеристик.ВидыСубконто.Контрагент] = Поставщик;
	Проводка.Субконто[ПланыВидовХарактеристик.ВидыСубконто.Валюта] = Валюта;
	Проводка.Субконто[ПланыВидовХарактеристик.ВидыСубконто.РасчетныйСчетКонтрагента] = РасчетныйСчетКонтрагента(Поставщик);
	
	Проводка = Движения.Основной.ДобавитьДебет();
	Проводка.Организация = Организация;
	Проводка.Период = Дата;
	Проводка.Сумма = Сумма;
	Проводка.Счет = ПланыСчетов.Основной.Товары;
	Проводка.Субконто[ПланыВидовХарактеристик.ВидыСубконто.Контрагент] = Поставщик;
	Проводка.Субконто[ПланыВидовХарактеристик.ВидыСубконто.Склад] = Склад;
	
КонецПроцедуры

Функция РасчетныйСчетКонтрагента(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РасчетныеСчетаКонтрагентов.Ссылка
	|ИЗ
	|	Справочник.РасчетныеСчетаКонтрагентов КАК РасчетныеСчетаКонтрагентов
	|ГДЕ
	|	РасчетныеСчетаКонтрагентов.Владелец = &Владелец
	|	И НЕ РасчетныеСчетаКонтрагентов.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка[0];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
